## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.event.published"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.event.published"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.grant_data.invalid"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.grant_data.invalid"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.invocation_batch_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.invocation_batch_size"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.item_image.build"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.item_image.build"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.item_image.malformatted_field"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.item_image.malformatted_field"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.PublishGrantEvents.record.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.PublishGrantEvents.record.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-08-16T04:13:34.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:17/invocations" -> (known after apply)
      ~ s3_key                         = "builds/39f387e776fb94374de61a4c5e678e70d9cbae8d6a8892c1bbbc5f51ba9cacd8.zip" -> "builds/3316377f8f89949922c2d7fef3580bad6d59091f1019c7e18815c9a664db0601.zip"
      ~ s3_object_version              = "dK6FsdWQBQR8Ug6H33K4ZBudPf1EuJCO" -> (known after apply)
        tags                           = {}
      ~ version                        = "17" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:f40c511c5def82c08887be27139a526f99ecbb26,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a" -> "f40c511c5def82c08887be27139a526f99ecbb26"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "17" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "482d6ff488b00189ee355eb666422f0a-2" -> (known after apply)
      ~ id                     = "builds/39f387e776fb94374de61a4c5e678e70d9cbae8d6a8892c1bbbc5f51ba9cacd8.zip" -> (known after apply)
      ~ key                    = "builds/39f387e776fb94374de61a4c5e678e70d9cbae8d6a8892c1bbbc5f51ba9cacd8.zip" -> "builds/3316377f8f89949922c2d7fef3580bad6d59091f1019c7e18815c9a664db0601.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/39f387e776fb94374de61a4c5e678e70d9cbae8d6a8892c1bbbc5f51ba9cacd8.zip" -> "builds/3316377f8f89949922c2d7fef3580bad6d59091f1019c7e18815c9a664db0601.zip"
-       tags                   = {} -> null
      ~ version_id             = "dK6FsdWQBQR8Ug6H33K4ZBudPf1EuJCO" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadFFISSpreadsheet
                            cd bin/DownloadFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/3316377f8f89949922c2d7fef3580bad6d59091f1019c7e18815c9a664db0601.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/3316377f8f89949922c2d7fef3580bad6d59091f1019c7e18815c9a664db0601.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8000925512014698357" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/39f387e776fb94374de61a4c5e678e70d9cbae8d6a8892c1bbbc5f51ba9cacd8.zip" -> "builds/3316377f8f89949922c2d7fef3580bad6d59091f1019c7e18815c9a664db0601.zip"
          ~ "timestamp" = "1692159175645646000" -> "1692328631185834000"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8656794298797426521" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/39f387e776fb94374de61a4c5e678e70d9cbae8d6a8892c1bbbc5f51ba9cacd8.zip" -> "builds/3316377f8f89949922c2d7fef3580bad6d59091f1019c7e18815c9a664db0601.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-08-16T04:13:36.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:42" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:42/invocations" -> (known after apply)
      ~ s3_key                         = "builds/ec6bcfe13ecc210570f6afd8139ca8a0ea6af5efa2173d11a94d0195ae7e05d2.zip" -> "builds/b4156cd3c893b56a582db0fcadd6b8a81d62078141f75bc138360d0b0a8601ef.zip"
      ~ s3_object_version              = "fDZcA3d.dzNbtFZRVta4GNOxaKs.b4GR" -> (known after apply)
        tags                           = {}
      ~ version                        = "42" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:f40c511c5def82c08887be27139a526f99ecbb26,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a" -> "f40c511c5def82c08887be27139a526f99ecbb26"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "42" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "914347e3a4ccfd5f5033190fbe5b1494-2" -> (known after apply)
      ~ id                     = "builds/ec6bcfe13ecc210570f6afd8139ca8a0ea6af5efa2173d11a94d0195ae7e05d2.zip" -> (known after apply)
      ~ key                    = "builds/ec6bcfe13ecc210570f6afd8139ca8a0ea6af5efa2173d11a94d0195ae7e05d2.zip" -> "builds/b4156cd3c893b56a582db0fcadd6b8a81d62078141f75bc138360d0b0a8601ef.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/ec6bcfe13ecc210570f6afd8139ca8a0ea6af5efa2173d11a94d0195ae7e05d2.zip" -> "builds/b4156cd3c893b56a582db0fcadd6b8a81d62078141f75bc138360d0b0a8601ef.zip"
-       tags                   = {} -> null
      ~ version_id             = "fDZcA3d.dzNbtFZRVta4GNOxaKs.b4GR" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/b4156cd3c893b56a582db0fcadd6b8a81d62078141f75bc138360d0b0a8601ef.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/b4156cd3c893b56a582db0fcadd6b8a81d62078141f75bc138360d0b0a8601ef.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3724925537508392661" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/ec6bcfe13ecc210570f6afd8139ca8a0ea6af5efa2173d11a94d0195ae7e05d2.zip" -> "builds/b4156cd3c893b56a582db0fcadd6b8a81d62078141f75bc138360d0b0a8601ef.zip"
          ~ "timestamp" = "1692159156105520000" -> "1692328609172471000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "5966660987970897589" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/ec6bcfe13ecc210570f6afd8139ca8a0ea6af5efa2173d11a94d0195ae7e05d2.zip" -> "builds/b4156cd3c893b56a582db0fcadd6b8a81d62078141f75bc138360d0b0a8601ef.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-08-16T04:13:34.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:22" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:22/invocations" -> (known after apply)
      ~ s3_key                         = "builds/561aab5821ec26a255d9344610b495f3e5827c79063e427b4bad8c539585fb79.zip" -> "builds/0ec7f92d7f4ecc8588d8791dd1e473ae0acfc1972d9fbd9580857354806a5bad.zip"
      ~ s3_object_version              = "2u2xhQLJ8xA7HZKByEAR70IYFjLgSF9Z" -> (known after apply)
        tags                           = {}
      ~ version                        = "22" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:f40c511c5def82c08887be27139a526f99ecbb26,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a" -> "f40c511c5def82c08887be27139a526f99ecbb26"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "22" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d39a07de3a857ddf924a3e0a81c0ed14-2" -> (known after apply)
      ~ id                     = "builds/561aab5821ec26a255d9344610b495f3e5827c79063e427b4bad8c539585fb79.zip" -> (known after apply)
      ~ key                    = "builds/561aab5821ec26a255d9344610b495f3e5827c79063e427b4bad8c539585fb79.zip" -> "builds/0ec7f92d7f4ecc8588d8791dd1e473ae0acfc1972d9fbd9580857354806a5bad.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/561aab5821ec26a255d9344610b495f3e5827c79063e427b4bad8c539585fb79.zip" -> "builds/0ec7f92d7f4ecc8588d8791dd1e473ae0acfc1972d9fbd9580857354806a5bad.zip"
-       tags                   = {} -> null
      ~ version_id             = "2u2xhQLJ8xA7HZKByEAR70IYFjLgSF9Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/0ec7f92d7f4ecc8588d8791dd1e473ae0acfc1972d9fbd9580857354806a5bad.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/0ec7f92d7f4ecc8588d8791dd1e473ae0acfc1972d9fbd9580857354806a5bad.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2213625998315647092" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/561aab5821ec26a255d9344610b495f3e5827c79063e427b4bad8c539585fb79.zip" -> "builds/0ec7f92d7f4ecc8588d8791dd1e473ae0acfc1972d9fbd9580857354806a5bad.zip"
          ~ "timestamp" = "1692159175938491200" -> "1692328630874523000"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8710046314066862677" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/561aab5821ec26a255d9344610b495f3e5827c79063e427b4bad8c539585fb79.zip" -> "builds/0ec7f92d7f4ecc8588d8791dd1e473ae0acfc1972d9fbd9580857354806a5bad.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-08-16T04:13:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:11" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:11/invocations" -> (known after apply)
      ~ s3_key                         = "builds/b0ef9f549b1b49d1c4f1989880466541952bdbdc2472cc0a5672f16285407587.zip" -> "builds/2afaebf8df4ff94430cf6d524c752d00279ce4a9f17a28604d18e26889a4d0b2.zip"
      ~ s3_object_version              = "9k7BEoMYJR3hAMyf.lj5yeALiDOgC_4b" -> (known after apply)
        tags                           = {}
      ~ version                        = "11" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:f40c511c5def82c08887be27139a526f99ecbb26,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a" -> "f40c511c5def82c08887be27139a526f99ecbb26"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "11" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "bf910087456c1947370b01c09e009b1e-2" -> (known after apply)
      ~ id                     = "builds/b0ef9f549b1b49d1c4f1989880466541952bdbdc2472cc0a5672f16285407587.zip" -> (known after apply)
      ~ key                    = "builds/b0ef9f549b1b49d1c4f1989880466541952bdbdc2472cc0a5672f16285407587.zip" -> "builds/2afaebf8df4ff94430cf6d524c752d00279ce4a9f17a28604d18e26889a4d0b2.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/b0ef9f549b1b49d1c4f1989880466541952bdbdc2472cc0a5672f16285407587.zip" -> "builds/2afaebf8df4ff94430cf6d524c752d00279ce4a9f17a28604d18e26889a4d0b2.zip"
-       tags                   = {} -> null
      ~ version_id             = "9k7BEoMYJR3hAMyf.lj5yeALiDOgC_4b" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-ExtractGrantsGovDBToXML
                            cd bin/ExtractGrantsGovDBToXML
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/2afaebf8df4ff94430cf6d524c752d00279ce4a9f17a28604d18e26889a4d0b2.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/2afaebf8df4ff94430cf6d524c752d00279ce4a9f17a28604d18e26889a4d0b2.plan.json"
+       id                   = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6013984126202893389" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b0ef9f549b1b49d1c4f1989880466541952bdbdc2472cc0a5672f16285407587.zip" -> "builds/2afaebf8df4ff94430cf6d524c752d00279ce4a9f17a28604d18e26889a4d0b2.zip"
          ~ "timestamp" = "1692159175534405000" -> "1692328631414733800"
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6228352507715543029" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/b0ef9f549b1b49d1c4f1989880466541952bdbdc2472cc0a5672f16285407587.zip" -> "builds/2afaebf8df4ff94430cf6d524c752d00279ce4a9f17a28604d18e26889a4d0b2.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistFFISData"
      ~ last_modified                  = "2023-08-16T04:13:34.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:12" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:12/invocations" -> (known after apply)
      ~ s3_key                         = "builds/9051089a5d2f7f0aade9e0d12796cbab41c25a93483d87aa307b53f9cb98159f.zip" -> "builds/e8990e6075de1ccc2b598795f9350b5d129d60b159e4e118fbeb24f97a4eac15.zip"
      ~ s3_object_version              = "kq7j9.TVtwo0tpMa88Byf7XS.uRKt02s" -> (known after apply)
        tags                           = {}
      ~ version                        = "12" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:f40c511c5def82c08887be27139a526f99ecbb26,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a" -> "f40c511c5def82c08887be27139a526f99ecbb26"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "12" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "016ae7a9edbb12b7a5dfdc3a124f80d8-2" -> (known after apply)
      ~ id                     = "builds/9051089a5d2f7f0aade9e0d12796cbab41c25a93483d87aa307b53f9cb98159f.zip" -> (known after apply)
      ~ key                    = "builds/9051089a5d2f7f0aade9e0d12796cbab41c25a93483d87aa307b53f9cb98159f.zip" -> "builds/e8990e6075de1ccc2b598795f9350b5d129d60b159e4e118fbeb24f97a4eac15.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/9051089a5d2f7f0aade9e0d12796cbab41c25a93483d87aa307b53f9cb98159f.zip" -> "builds/e8990e6075de1ccc2b598795f9350b5d129d60b159e4e118fbeb24f97a4eac15.zip"
-       tags                   = {} -> null
      ~ version_id             = "kq7j9.TVtwo0tpMa88Byf7XS.uRKt02s" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistFFISData
                            cd bin/PersistFFISData
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/e8990e6075de1ccc2b598795f9350b5d129d60b159e4e118fbeb24f97a4eac15.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/e8990e6075de1ccc2b598795f9350b5d129d60b159e4e118fbeb24f97a4eac15.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5022024198486956175" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9051089a5d2f7f0aade9e0d12796cbab41c25a93483d87aa307b53f9cb98159f.zip" -> "builds/e8990e6075de1ccc2b598795f9350b5d129d60b159e4e118fbeb24f97a4eac15.zip"
          ~ "timestamp" = "1692159175822396000" -> "1692328630667376000"
        }
    }

  # module.PersistFFISData.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "3819219717183709430" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/9051089a5d2f7f0aade9e0d12796cbab41c25a93483d87aa307b53f9cb98159f.zip" -> "builds/e8990e6075de1ccc2b598795f9350b5d129d60b159e4e118fbeb24f97a4eac15.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-08-16T04:13:34.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:14" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:14/invocations" -> (known after apply)
      ~ s3_key                         = "builds/e840ef9ea620b7312a85b479511dd367286ea28004611e0bfb49bd333f8513b4.zip" -> "builds/454287a1f568cb03297fb3d2c9c7cc1061d54be17e038dfd781a3aa3711ce56a.zip"
      ~ s3_object_version              = "iFmQ753ZXAk9BNoMDa0VyC1GGlvg6Tl_" -> (known after apply)
        tags                           = {}
      ~ version                        = "14" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:f40c511c5def82c08887be27139a526f99ecbb26,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a" -> "f40c511c5def82c08887be27139a526f99ecbb26"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "14" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "25e95571a20b401d350aefaaaaf4266b-2" -> (known after apply)
      ~ id                     = "builds/e840ef9ea620b7312a85b479511dd367286ea28004611e0bfb49bd333f8513b4.zip" -> (known after apply)
      ~ key                    = "builds/e840ef9ea620b7312a85b479511dd367286ea28004611e0bfb49bd333f8513b4.zip" -> "builds/454287a1f568cb03297fb3d2c9c7cc1061d54be17e038dfd781a3aa3711ce56a.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/e840ef9ea620b7312a85b479511dd367286ea28004611e0bfb49bd333f8513b4.zip" -> "builds/454287a1f568cb03297fb3d2c9c7cc1061d54be17e038dfd781a3aa3711ce56a.zip"
-       tags                   = {} -> null
      ~ version_id             = "iFmQ753ZXAk9BNoMDa0VyC1GGlvg6Tl_" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistGrantsGovXMLDB
                            cd bin/PersistGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/454287a1f568cb03297fb3d2c9c7cc1061d54be17e038dfd781a3aa3711ce56a.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/454287a1f568cb03297fb3d2c9c7cc1061d54be17e038dfd781a3aa3711ce56a.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2524595984553742720" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/e840ef9ea620b7312a85b479511dd367286ea28004611e0bfb49bd333f8513b4.zip" -> "builds/454287a1f568cb03297fb3d2c9c7cc1061d54be17e038dfd781a3aa3711ce56a.zip"
          ~ "timestamp" = "1692159156563965000" -> "1692328609500594000"
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "575082815303890362" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/e840ef9ea620b7312a85b479511dd367286ea28004611e0bfb49bd333f8513b4.zip" -> "builds/454287a1f568cb03297fb3d2c9c7cc1061d54be17e038dfd781a3aa3711ce56a.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PublishGrantEvents"
      ~ last_modified                  = "2023-08-16T04:13:34.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PublishGrantEvents:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PublishGrantEvents:4/invocations" -> (known after apply)
      ~ s3_key                         = "builds/166d7c8524c957ebe9474f9ea8f770e00b47fa392e816621f6d301618e367ab3.zip" -> "builds/4d94ca4225ede2d156c1a37e5a606d21876d2c59f290dedd20bc235a10a19e5d.zip"
      ~ s3_object_version              = "KXHTzvPGhlcqJnMQ8JSudLu8HGOqFs8R" -> (known after apply)
        tags                           = {}
      ~ version                        = "4" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents" -> "git.commit.sha:f40c511c5def82c08887be27139a526f99ecbb26,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents"
              ~ "DD_VERSION"                   = "8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a" -> "f40c511c5def82c08887be27139a526f99ecbb26"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_permission.current_version_triggers["dynamodb"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "dynamodb" -> (known after apply)
      ~ qualifier           = "4" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "0f3c8aa054161280fa279b76ef1b6e99-2" -> (known after apply)
      ~ id                     = "builds/166d7c8524c957ebe9474f9ea8f770e00b47fa392e816621f6d301618e367ab3.zip" -> (known after apply)
      ~ key                    = "builds/166d7c8524c957ebe9474f9ea8f770e00b47fa392e816621f6d301618e367ab3.zip" -> "builds/4d94ca4225ede2d156c1a37e5a606d21876d2c59f290dedd20bc235a10a19e5d.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/166d7c8524c957ebe9474f9ea8f770e00b47fa392e816621f6d301618e367ab3.zip" -> "builds/4d94ca4225ede2d156c1a37e5a606d21876d2c59f290dedd20bc235a10a19e5d.zip"
-       tags                   = {} -> null
      ~ version_id             = "KXHTzvPGhlcqJnMQ8JSudLu8HGOqFs8R" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PublishGrantEvents
                            cd bin/PublishGrantEvents
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/4d94ca4225ede2d156c1a37e5a606d21876d2c59f290dedd20bc235a10a19e5d.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/4d94ca4225ede2d156c1a37e5a606d21876d2c59f290dedd20bc235a10a19e5d.plan.json"
+       id                   = (known after apply)
    }

  # module.PublishGrantEvents.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3479137043092664553" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/166d7c8524c957ebe9474f9ea8f770e00b47fa392e816621f6d301618e367ab3.zip" -> "builds/4d94ca4225ede2d156c1a37e5a606d21876d2c59f290dedd20bc235a10a19e5d.zip"
          ~ "timestamp" = "1692159157034101000" -> "1692328610742960000"
        }
    }

  # module.PublishGrantEvents.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6416425785112105658" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/166d7c8524c957ebe9474f9ea8f770e00b47fa392e816621f6d301618e367ab3.zip" -> "builds/4d94ca4225ede2d156c1a37e5a606d21876d2c59f290dedd20bc235a10a19e5d.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-ReceiveFFISEmail"
      ~ last_modified                  = "2023-08-16T04:13:35.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ReceiveFFISEmail:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ReceiveFFISEmail:2/invocations" -> (known after apply)
      ~ s3_key                         = "builds/d704f78d29eb428758b6a5bb23c5f8c837b5b74156b826f30959864e3544d94d.zip" -> "builds/a4a8588b5bf844625606ffcc90710bcd6e87f7fe4fdb7af60f1faa78af6249a1.zip"
      ~ s3_object_version              = "2E_PMy8_o4pJPVYYfzNlz.KdBtNGbQO5" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail" -> "git.commit.sha:f40c511c5def82c08887be27139a526f99ecbb26,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail"
              ~ "DD_VERSION"                     = "8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a" -> "f40c511c5def82c08887be27139a526f99ecbb26"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "b26c648c573b8aad91548ec61af0e1c4-2" -> (known after apply)
      ~ id                     = "builds/d704f78d29eb428758b6a5bb23c5f8c837b5b74156b826f30959864e3544d94d.zip" -> (known after apply)
      ~ key                    = "builds/d704f78d29eb428758b6a5bb23c5f8c837b5b74156b826f30959864e3544d94d.zip" -> "builds/a4a8588b5bf844625606ffcc90710bcd6e87f7fe4fdb7af60f1faa78af6249a1.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/d704f78d29eb428758b6a5bb23c5f8c837b5b74156b826f30959864e3544d94d.zip" -> "builds/a4a8588b5bf844625606ffcc90710bcd6e87f7fe4fdb7af60f1faa78af6249a1.zip"
-       tags                   = {} -> null
      ~ version_id             = "2E_PMy8_o4pJPVYYfzNlz.KdBtNGbQO5" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-ReceiveFFISEmail
                            cd bin/ReceiveFFISEmail
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/a4a8588b5bf844625606ffcc90710bcd6e87f7fe4fdb7af60f1faa78af6249a1.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/a4a8588b5bf844625606ffcc90710bcd6e87f7fe4fdb7af60f1faa78af6249a1.plan.json"
+       id                   = (known after apply)
    }

  # module.ReceiveFFISEmail.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4677978295327092697" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/d704f78d29eb428758b6a5bb23c5f8c837b5b74156b826f30959864e3544d94d.zip" -> "builds/a4a8588b5bf844625606ffcc90710bcd6e87f7fe4fdb7af60f1faa78af6249a1.zip"
          ~ "timestamp" = "1692159176042572000" -> "1692328631384757000"
        }
    }

  # module.ReceiveFFISEmail.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4063111076056062629" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/d704f78d29eb428758b6a5bb23c5f8c837b5b74156b826f30959864e3544d94d.zip" -> "builds/a4a8588b5bf844625606ffcc90710bcd6e87f7fe4fdb7af60f1faa78af6249a1.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-08-16T04:13:35.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:13" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:13/invocations" -> (known after apply)
      ~ s3_key                         = "builds/c0d520a892ed3950238518f54dec2cdeca14f61094d039bdb783257302c336e4.zip" -> "builds/c8d985e04494e01a013bf19073d257721757f91aaa15ddee71a9207cdc829429.zip"
      ~ s3_object_version              = "5wsLGt14PIsscJaOH16c4iwoBT0bb83N" -> (known after apply)
        tags                           = {}
      ~ version                        = "13" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:f40c511c5def82c08887be27139a526f99ecbb26,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a" -> "f40c511c5def82c08887be27139a526f99ecbb26"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "13" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "52711ff4e530cf39f5687e8b7459c095-2" -> (known after apply)
      ~ id                     = "builds/c0d520a892ed3950238518f54dec2cdeca14f61094d039bdb783257302c336e4.zip" -> (known after apply)
      ~ key                    = "builds/c0d520a892ed3950238518f54dec2cdeca14f61094d039bdb783257302c336e4.zip" -> "builds/c8d985e04494e01a013bf19073d257721757f91aaa15ddee71a9207cdc829429.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/c0d520a892ed3950238518f54dec2cdeca14f61094d039bdb783257302c336e4.zip" -> "builds/c8d985e04494e01a013bf19073d257721757f91aaa15ddee71a9207cdc829429.zip"
-       tags                   = {} -> null
      ~ version_id             = "5wsLGt14PIsscJaOH16c4iwoBT0bb83N" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitFFISSpreadsheet
                            cd bin/SplitFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/c8d985e04494e01a013bf19073d257721757f91aaa15ddee71a9207cdc829429.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/c8d985e04494e01a013bf19073d257721757f91aaa15ddee71a9207cdc829429.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6668142059584212739" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c0d520a892ed3950238518f54dec2cdeca14f61094d039bdb783257302c336e4.zip" -> "builds/c8d985e04494e01a013bf19073d257721757f91aaa15ddee71a9207cdc829429.zip"
          ~ "timestamp" = "1692159175688315000" -> "1692328631046565000"
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6082871315858741117" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/c0d520a892ed3950238518f54dec2cdeca14f61094d039bdb783257302c336e4.zip" -> "builds/c8d985e04494e01a013bf19073d257721757f91aaa15ddee71a9207cdc829429.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-08-16T04:13:34.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:41" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:41/invocations" -> (known after apply)
      ~ s3_key                         = "builds/71c7838417380501d444ccf51e0c133a12da00422789a5f7bc460d3e0efa09e9.zip" -> "builds/f4c8e044e6d999b6bff74748e1a0bc45ee61b3da3721be68440dcfbbc9d32697.zip"
      ~ s3_object_version              = "HrsmY3j90rEofBYo.TadW.cT5smPFP6r" -> (known after apply)
        tags                           = {}
      ~ version                        = "41" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:f40c511c5def82c08887be27139a526f99ecbb26,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "8e92a8a001f2d4ae8bd424ab998dccf8e798eb2a" -> "f40c511c5def82c08887be27139a526f99ecbb26"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "41" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "0553cd707b00d25f62193fb2d8c5e41d-2" -> (known after apply)
      ~ id                     = "builds/71c7838417380501d444ccf51e0c133a12da00422789a5f7bc460d3e0efa09e9.zip" -> (known after apply)
      ~ key                    = "builds/71c7838417380501d444ccf51e0c133a12da00422789a5f7bc460d3e0efa09e9.zip" -> "builds/f4c8e044e6d999b6bff74748e1a0bc45ee61b3da3721be68440dcfbbc9d32697.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/71c7838417380501d444ccf51e0c133a12da00422789a5f7bc460d3e0efa09e9.zip" -> "builds/f4c8e044e6d999b6bff74748e1a0bc45ee61b3da3721be68440dcfbbc9d32697.zip"
-       tags                   = {} -> null
      ~ version_id             = "HrsmY3j90rEofBYo.TadW.cT5smPFP6r" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/f4c8e044e6d999b6bff74748e1a0bc45ee61b3da3721be68440dcfbbc9d32697.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/f4c8e044e6d999b6bff74748e1a0bc45ee61b3da3721be68440dcfbbc9d32697.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2529870516741858564" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/71c7838417380501d444ccf51e0c133a12da00422789a5f7bc460d3e0efa09e9.zip" -> "builds/f4c8e044e6d999b6bff74748e1a0bc45ee61b3da3721be68440dcfbbc9d32697.zip"
          ~ "timestamp" = "1692159156479876000" -> "1692328609104033000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4108815798803446165" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/71c7838417380501d444ccf51e0c133a12da00422789a5f7bc460d3e0efa09e9.zip" -> "builds/f4c8e044e6d999b6bff74748e1a0bc45ee61b3da3721be68440dcfbbc9d32697.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 50 to add, 21 to change, 40 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/5898398878)*